export const CLOTHES_MALE_CONFIG = {
  // MALE (мужск.)
  // [drawable, name, weight?, price?, maxWeight? (для сумок), variations?]

  // ГОЛОВНЫЕ УБОРЫ - props[0] //
  0: [
    [0, 'Полноразмерные наушники', 0.3, 400, undefined, 8],
    [1, "Белый колпак 'Dunke'", 0.15, 250, undefined, 1],
    [2, "Шапка Бини", 0.25, 450, undefined, 8],
    [3, "Панамка", 0.15, 300, undefined, 8],
    [4, "Бейсболка LS", 0.2, 600, undefined, 2],
    [5, "Трикотажная шапочка", 0.25, 500, undefined, 2],
  ],

  // УКРАШЕНИЯ - props[2], clothes[7] //
  1: [
    // clothes[7]
    [10, 'Широкий галстук', 0.1, 300, undefined, 3, 7],
    [11, 'Классическая бабочка', 0.05, 200, undefined, 3, 7],
    [12, 'Тонкий галстук', 0.1, 300, undefined, 3, 7],
    [16, 'Цепочка Бисмарк', 0.15, 1100, undefined, 3, 7],
    [17, 'Цепочка Бисмарк 2', 0.15, 1100, undefined, 3, 7],
    [18, 'Красный широкий галстук', 0.1, 250, undefined, 1, 7],
    [19, 'Красный узкий галстук', 0.1, 250, undefined, 1, 7],

    // props[2]
    [5, 'Серьги-кольца', 0.05, 1500, undefined, 3, 2],
  ],

  // МАСКИ - clothes[1] //
  2: [
    [1, 'Маска свиньи', 0.3, 700, undefined, 4],
    [2, 'Маска черепа', 0.3, 750, undefined, 4],
    [3, 'Маска обезьяны', 0.4, 800, undefined, 1],
    [4, 'Хоккейная маска', 0.5, 900, undefined, 4],
    [5, 'Маска неандертальца', 0.4, 800, undefined, 4],
  ],

  // ОЧКИ - props[1] //
  3: [
    [2, 'Прямоугольные очки', 0.15, 600, undefined, 11],
    [3, 'Очки Lincer', 0.15, 1000, undefined, 11],
    [4, 'Очки Пилот', 0.15, 1000, undefined, 11],
    [5, 'Очки Vektor', 0.15, 1000, undefined, 11],
    [7, 'Очки Varn', 0.15, 1000, undefined, 11],
  ],

  // БРАСЛЕТЫ - props[7]
  4: [
    [0, "Серебрянный браслет BJ", 0.2, 1800, undefined, 1],
  ],

  // ФУТБОЛКИ - clothes[11] //
  5: [
    [0, 'Классическая футболка', 0.3, 500, undefined, 6],
    [1, 'Футболка V-образная', 0.3, 600, undefined, 2],
    [5, 'Майка', 0.25, 550, undefined, 3],
    [8, 'Футболка Trenn', 0.4, 800, undefined, 1],
    [9, 'Поло Stren', 0.4, 800, undefined, 8],
  ],

  // ПЕРЧАТКИ - clothes[3] //
  6: [
    [16, "Перчатки 'Glove'", 0.1, 400, undefined, 1],
    [17, "Перчатки 'Boxe'", 0.1, 550, undefined, 5],
    [18, "Перчатки 'Knit'", 0.1, 1200, undefined, 5],
    [19, "Перчатки 'Rage''", 0.1, 1000, undefined, 2],
    [20, "Перчатки 'Rage''", 0.1, 1000, undefined, 2],
    [30, "Перчатки 'Rage' #2'", 0.1, 1050, undefined, 2],
  ],

  // БРОНЕЖИЛЕТЫ - clothes[9] //
  7: [
    [1, "Легкий бронежилет", 1, 3500, undefined, 5],
    [15, "Бронежилет средн. тяжести", 1.5, 4200, undefined, 3],
    [15, "Тяжелый бронежилет", 2.2, 5000, undefined, 3],
    [26, "Легкий бронежилет #2", 1, 3500, undefined, 10],
  ],

  // ВЕРХ - clothes[11] //
  8: [
    [3, 'Кофта Zarnet', 0.5, 950, undefined, 16],
    [4, 'Пиджак классический (растёгн-ый)', 0.5, 800, undefined, 1],
    [6, 'Куртка кожаная', 0.7, 1000, undefined, 2],
    [7, 'Худи классическое на молнии', 0.5, 1200, undefined, 16],
    [10, 'Пиджак классический (застёг-ый)', 0.5, 1200, undefined, 16],
  ],

  // ЧАСЫ - props[6]
  9: [
    [0, 'Мультициферблатные часы', 0.2, 1200, undefined, 1],
    [1, 'Цифровые часы #1', 0.2, 900, undefined, 1],
    [3, 'Спортивные часы', 0.2, 1000, undefined, 5],
    [4, "Часы 'Хроно'", 0.2, 1000, undefined, 4],
    [5, "Цифровые часы #2", 0.2, 1100, undefined, 4],
    [6, "Часы 'Таймекс'", 0.2, 1100, undefined, 4],
    // Только часы (prop 6)
  ],

  // СУМКИ - clothes[5]
  10: [
    [40, 'Сумка Darnel', 0.3, 4500, 20.0, 1],
    [41, 'Сумка Darnel 2', 0.3, 5500, 25.0, 1],
    [44, 'Сумка Varnet', 0.3, 7000, 30.0, 1],
    [45, 'Сумка Varnet 2', 0.3, 8000, 32.5, 1],
    [81, 'Сумка Trelmor', 0.3, 10000, 38.0, 16],
    [82, 'Сумка Trelmor 2', 0.3, 12000, 42.5, 16],
    [85, 'Сумка Harnet', 0.3, 18000, 48, 25],
    [86, 'Сумка Harnet 2', 0.3, 20000, 52.5, 25],
  ],

  // ШТАНЫ - clothes[4]
  11: [
    [0, 'Джинсы классические', 0.3, 600, undefined, 16],
    [1, 'Джинсы прямого кроя', 0.3, 800, undefined, 16],
    [3, 'Штаны домашние', 0.35, 750, undefined, 16],
    [4, 'Джинсы зауженные', 0.35, 800, undefined, 16],
    [5, 'Штаны свободные домашние', 0.3, 700, undefined, 16],
  ],

  // ОБУВЬ - clothes[6]
  12: [
    [1, 'Кеды повседневные', 0.5, 600, undefined, 16],
    [3, 'Туфли со шнуровкой', 0.6, 500, undefined, 16],
    [4, 'Кеды высокие повседневные', 0.5, 600, undefined, 3],
    [5, 'Пляжные шлёпки', 0.35, 400, undefined, 4],
    [6, 'Шлёпанцы с носками', 0.4, 650, undefined, 2],
  ],
} as const