import { FC } from 'react'
import { useSelector } from 'react-redux'
import { RootState } from '../../../reducers/rootReducer'
import { sys } from '../../../../shared/sys'
import '../assets/styles/compiled-css/Info.css'

interface IInfoDeath {
  killer: string,
  chanceReborn: number,
  timeDead: string
}

const InfoDeath: FC<IInfoDeath> = ({ killer, chanceReborn, timeDead }) => {
  const fate = useSelector((state: RootState) => state.deathReducer.fate)
  const plInfo = useSelector((state: RootState) => state.playerInfoReducer)

  const killerInfo = killer !== `${plInfo.nickname} #${plInfo.sid}` ? killer : 'Самоубийство'

  const getInfo = (type: 'title' | 'subtitle'): string => {
    switch (fate) {
      case 'medic':
        return type === 'title' ? 'Вы вызвали медиков' : 'Свободные медики примут вызов и приедут на помощь'
      case 'death':
        return type === 'title' ? 'Вас настигает смерть' : 'Если вам никто не поможет, вы окажетесь в реанимации'
      case 'chance':
        return type === 'title' ? 'А ты счастливчик?' : 'Может быть вам повезет и получится выжить'
      default:
        return type === 'title' ? 'Вас настигает смерть' : 'Если вам никто не поможет, вы окажетесь в реанимации'
    }
  }
  
  return (
    <>
      <div className="info-death">
        <div className="header">
          <div className="title-block" id={`${fate}-tb`}>
            { fate === 'medic' && (
              <svg className='icon-outcome' width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M56 36.3665H37.0035V56H18.8975V36.3665H0V19.5219H18.8975V0H37.0035V19.5219H56V36.3665Z" fill="#D9D9D9" />
              </svg>
            ) }
            { fate === 'death' && (
              <svg className='icon-outcome' width="56" height="46" viewBox="0 0 56 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M28 0C43.4638 5.39895e-05 55.9999 12.3891 56 27.6709C56 29.7063 55.7756 31.6903 55.3535 33.6006H50.0713C44.7955 33.6006 40.5187 37.8775 40.5186 43.1533V45.459H37.5527V42.9883C37.5525 41.806 36.5944 40.8477 35.4121 40.8477C34.2297 40.8477 33.2708 41.806 33.2705 42.9883V45.459H29.9775V42.9883C29.9773 41.806 29.0183 40.8477 27.8359 40.8477C26.6536 40.8477 25.6956 41.806 25.6953 42.9883V45.459H23.0586V43.1533C23.0584 41.8799 22.0263 40.8477 20.7529 40.8477C19.4796 40.8478 18.4474 41.88 18.4473 43.1533V45.459H15.4814V42.165C15.4813 37.435 11.647 33.6006 6.91699 33.6006H0.646484C0.224401 31.6903 1.038e-05 29.7063 0 27.6709C0.000146335 12.389 12.5362 0 28 0ZM28.4824 26.6826C27.9752 25.8045 26.7074 25.8045 26.2002 26.6826L22.4912 33.1055C21.9841 33.9839 22.6185 35.082 23.6328 35.082H31.0498C32.064 35.0818 32.6975 33.9838 32.1904 33.1055L28.4824 26.6826ZM13.501 17.459C9.49886 17.4591 6.25424 20.6299 6.25391 24.541C6.25391 25.0493 6.30994 25.5455 6.41406 26.0234H20.5879C20.692 25.5455 20.748 25.0493 20.748 24.541C20.7477 20.6298 17.5032 17.459 13.501 17.459ZM41.5029 17.459C37.5007 17.459 34.2562 20.6298 34.2559 24.541C34.2559 25.0493 34.3119 25.5455 34.416 26.0234H48.5898C48.694 25.5455 48.75 25.0493 48.75 24.541C48.7497 20.6298 45.5051 17.459 41.5029 17.459Z" fill="#CFCDC7" />
              </svg>
            ) }
            { fate === 'chance' && (
              <svg className='icon-outcome' width="68" height="41" viewBox="0 0 68 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M6.78772 5.98438C7.08954 4.8587 8.2469 4.18974 9.37268 4.49121L34.4362 11.207L34.6403 11.2744C35.6403 11.6543 36.2112 12.7374 35.9283 13.793L29.2125 38.8555L29.1461 39.0605C28.7914 39.9937 27.824 40.5522 26.8385 40.3926L26.6276 40.3477L1.56506 33.6328L1.35901 33.5654C0.42598 33.2109 -0.132193 32.2441 0.0269753 31.2588L0.0718972 31.0479L6.78772 5.98438ZM22.9947 27.0547C21.8688 26.753 20.7116 27.421 20.4098 28.5469C20.1081 29.6728 20.7761 30.83 21.902 31.1318C23.0279 31.4335 24.1851 30.7655 24.4869 29.6396C24.7886 28.5137 24.1207 27.3564 22.9947 27.0547ZM16.2565 25.249C15.1306 24.9473 13.9733 25.6154 13.6715 26.7412C13.3698 27.8672 14.0377 29.0245 15.1637 29.3262C16.2896 29.6279 17.4469 28.9599 17.7487 27.834C18.0503 26.7081 17.3823 25.5508 16.2565 25.249ZM9.51721 23.4434C8.39141 23.1419 7.234 23.8098 6.93225 24.9355C6.63054 26.0615 7.29942 27.2188 8.42541 27.5205C9.55134 27.8221 10.7087 27.1542 11.0104 26.0283C11.312 24.9024 10.6432 23.7451 9.51721 23.4434ZM26.1393 15.3203C25.0135 15.0187 23.8553 15.6869 23.5533 16.8125C23.2516 17.9385 23.9205 19.0967 25.0465 19.3984C26.1724 19.7 27.3298 19.0312 27.6315 17.9053C27.9328 16.7796 27.2649 15.6221 26.1393 15.3203ZM19.4 13.5146C18.2744 13.2132 17.1171 13.8814 16.8151 15.0068C16.5134 16.1328 17.1822 17.2911 18.3082 17.5928C19.4341 17.8941 20.5915 17.2254 20.8932 16.0996C21.1944 14.9739 20.5258 13.8163 19.4 13.5146ZM12.6617 11.709C11.5359 11.4074 10.3786 12.0764 10.0768 13.2021C9.77533 14.328 10.4432 15.4854 11.569 15.7871C12.695 16.0888 13.8522 15.4199 14.1539 14.2939C14.4552 13.1682 13.7875 12.0106 12.6617 11.709Z" fill="#CFCDC7" />
                <path fill-rule="evenodd" clip-rule="evenodd" d="M65.8287 0.0126953C66.8929 0.120805 67.724 1.01868 67.7242 2.11133V28.0586L67.7135 28.2744C67.6122 29.2674 66.8218 30.0574 65.8287 30.1582L65.6139 30.1689H39.6666L39.4518 30.1582C38.4585 30.0575 37.6683 29.2675 37.567 28.2744L37.5563 28.0586V2.11133C37.5565 0.945862 38.5011 9.26407e-05 39.6666 0H65.6139L65.8287 0.0126953ZM52.6403 20.0732C51.4748 20.0732 50.5304 21.0183 50.5299 22.1836C50.5299 23.3493 51.4745 24.2949 52.6403 24.2949C53.806 24.2949 54.7506 23.3493 54.7506 22.1836C54.7501 21.0183 53.8057 20.0733 52.6403 20.0732ZM52.6403 13.0967C51.4747 13.0967 50.5301 14.0425 50.5299 15.208C50.53 16.3736 51.4746 17.3184 52.6403 17.3184C53.8059 17.3183 54.7505 16.3736 54.7506 15.208C54.7504 14.0425 53.8058 13.0967 52.6403 13.0967ZM52.6403 6.12109C51.4747 6.12109 50.5302 7.06596 50.5299 8.23145C50.5299 9.39716 51.4745 10.3418 52.6403 10.3418C53.806 10.3418 54.7506 9.39715 54.7506 8.23145C54.7503 7.06597 53.8058 6.12111 52.6403 6.12109Z" fill="#CFCDC7" />
              </svg>
            )}
            <span className="title">{getInfo('title')}</span>
          </div>
          <span className="descr">{getInfo('subtitle')}</span>
        </div>
        <hr/>
        <div className="death-info">
          <div className="line">
            <span className="text">Время потери сознания</span>
            <span className="param">{timeDead}</span>
          </div>
          { killer !== '' && (
            <div className="line">
              <span className="text">Убил</span>
              <span className="param">{killerInfo}</span>
            </div>
          ) }
        </div>
        { fate === 'chance' && (
          <div className="chance-reborn">
            <div className="text-line">
              <span className="title">Вероятность возрождения</span>
              <span className="chance">{chanceReborn}%</span>
            </div>
            <div className="line-chance">
              <div className="bg-line"></div>
              <div className="active-line" style={{ width: `${chanceReborn}%` }}></div>
            </div>
          </div>
        ) }
      </div>
    </>
  )
}

export default InfoDeath